
(function()  {
	'use strict';
	
    /*---------------------------------------------------------------
	 parameter
	---------------------------------------------------------------*/
	

	/*---------------------------------------------------------------
	 function
	---------------------------------------------------------------*/
	
    
    /*---------------------------------------------------------------
	 event
	---------------------------------------------------------------*/
	//創建後 限制修改
    kintone.events.on('app.record.edit.show', function(event){
        var record = event.record
            //record['上次打卡紀錄日期'].disabled = true
            record['LOG更新時間'].disabled = true
            record['打卡紀錄'].disabled = true
        return event
    })
})()


